OneToThreeCreator/Unitree_g1_edu_control_panel/head_unitree_custom/src/esp32_control_light.cpp
/*
  esp32_control_light.cpp
  ═══════════════════════════════════════════════════════════════════════
  Light-прошивка «Управление умной головой Кузьмича» для ESP32-C3.
  Добавлено автоматическое моргание с настраиваемой периодичностью,
  инверсия управления правым серво, обновлены калибровки.
*/

#include <Arduino.h>
#include <WiFi.h>
#include <ESPAsyncWebServer.h>
#include <WebSocketsServer.h>
#include <Adafruit_NeoPixel.h>
#include <ArduinoJson.h>
#include <ESPmDNS.h>
#include <Preferences.h>
#include <ArduinoOTA.h>
#include <esp_task_wdt.h>
#include <LittleFS.h>

#if ENABLE_SERVOS
  #include <ESP32Servo.h>
#endif

#include "config.h"

// ═══════════════════════════════════════════════════════════════════════
//  Globals
// ═══════════════════════════════════════════════════════════════════════

AsyncWebServer    server(80);
WebSocketsServer  webSocket(81);
Adafruit_NeoPixel strip(LED_COUNT, LED_PIN, NEO_GRB + NEO_KHZ800);
Preferences       prefs;

// ── LED state ──────────────────────────────────────────────────────────
String   currentAnimation = DEFAULT_ANIMATION;
uint32_t staticColor      = DEFAULT_COLOR;
uint32_t bgColor          = DEFAULT_COLOR2;
int      ledBrightness    = DEFAULT_BRIGHTNESS;
int      animationSpeed   = DEFAULT_SPEED;
unsigned long lastAnimStep = 0;
int      animStep          = 0;

// ── Servo state ────────────────────────────────────────────────────────
#if ENABLE_SERVOS
Servo servo1;
Servo servo2;
int   servo1Angle   = 90;
int   servo2Angle   = 90;
bool  servo1Enabled = true;
bool  servo2Enabled = true;
int   servoSpeed    = DEFAULT_SERVO_SPEED;
#endif

// ── Auto blink state ──────────────────────────────────────────────────
bool  autoBlinkEnabled   = DEFAULT_AUTO_BLINK_ENABLED;
unsigned long autoBlinkInterval = DEFAULT_AUTO_BLINK_INTERVAL;
unsigned long lastBlinkTime = 0;

// ── Misc runtime ───────────────────────────────────────────────────────
unsigned long lastStateChange  = 0;
bool          stateDirty       = false;
unsigned long lastHeartbeat    = 0;
int           wsClientCount    = 0;

// ── Hardening ──────────────────────────────────────────────────────────
struct WsClientInfo {
  unsigned long firstMsgTime = 0;
  int           msgCount     = 0;
  unsigned long lastMsgTime  = 0;
  bool          active       = false;
};
WsClientInfo wsClients[8];

struct HttpRateEntry {
  IPAddress     ip;
  unsigned long windowStart = 0;
  int           count       = 0;
};
HttpRateEntry httpRate[16];
const int HTTP_RATE_MAX = 30;
const unsigned long HTTP_RATE_WINDOW = 1000;

unsigned long lastRebootRequest = 0;

// ── Servo macro scheduler ─────────────────────────────────────────────
#if ENABLE_SERVOS
struct MacroStep {
  unsigned long delayMs;
  uint8_t  which;          // 1, 2 или 3 (= оба)
  int      angle;
};
const int MACRO_MAX_STEPS = 24; // увеличили для новых макросов
struct MacroState {
  MacroStep steps[MACRO_MAX_STEPS];
  int       stepCount = 0;
  int       curStep   = 0;
  bool      active    = false;
  unsigned long stepStartTime = 0;
  String    name = "";
};
MacroState macro;
#endif

// ═══════════════════════════════════════════════════════════════════════
//  Forward declarations
// ═══════════════════════════════════════════════════════════════════════

void loadState();
void saveState();
void markStateDirty();
uint32_t colorWheel(byte wheelPos);
void updateAnimation();
void sendState(uint8_t clientNum);
void broadcastState();
void handleWebSocketMessage(uint8_t clientNum, const char* payload);
void onWebSocketEvent(uint8_t clientNum, WStype_t type, uint8_t* payload, size_t length);
void setupHTTP();
void setupOTA();
void setupWiFi();
void setupWDT();
bool wsRateLimitOk(uint8_t clientNum);
bool httpRateLimitOk(AsyncWebServerRequest* req);
void wsResetClient(uint8_t clientNum);
#if ENABLE_SERVOS
void startMacro(const String& name);
void updateMacro();
void stopMacro();
void attachServos();
void setServo(int which, int angle);
void enableServo(int which, bool enabled);
#endif

// ═══════════════════════════════════════════════════════════════════════
//  NVS state persistence
// ═══════════════════════════════════════════════════════════════════════

void loadState() {
  prefs.begin("state", true);
  currentAnimation = prefs.getString("anim",    DEFAULT_ANIMATION);
  ledBrightness    = prefs.getInt   ("bright",  DEFAULT_BRIGHTNESS);
  animationSpeed   = prefs.getInt   ("speed",   DEFAULT_SPEED);
  staticColor      = prefs.getUInt  ("color",   DEFAULT_COLOR);
  bgColor          = prefs.getUInt  ("color2",  DEFAULT_COLOR2);
#if ENABLE_SERVOS
  servo1Angle      = prefs.getInt   ("s1angle", 90);
  servo2Angle      = prefs.getInt   ("s2angle", 90);
  servo1Enabled    = prefs.getBool  ("s1en",    true);
  servo2Enabled    = prefs.getBool  ("s2en",    true);
  servoSpeed       = prefs.getInt   ("svspd",   DEFAULT_SERVO_SPEED);
#endif
  autoBlinkEnabled = prefs.getBool  ("autoblink", DEFAULT_AUTO_BLINK_ENABLED);
  autoBlinkInterval= prefs.getULong ("blinkint", DEFAULT_AUTO_BLINK_INTERVAL);
  prefs.end();
}

void saveState() {
  prefs.begin("state", false);
  prefs.putString("anim",   currentAnimation);
  prefs.putInt   ("bright", ledBrightness);
  prefs.putInt   ("speed",  animationSpeed);
  prefs.putUInt  ("color",  staticColor);
  prefs.putUInt  ("color2", bgColor);
#if ENABLE_SERVOS
  prefs.putInt   ("s1angle", servo1Angle);
  prefs.putInt   ("s2angle", servo2Angle);
  prefs.putBool  ("s1en",    servo1Enabled);
  prefs.putBool  ("s2en",    servo2Enabled);
  prefs.putInt   ("svspd",   servoSpeed);
#endif
  prefs.putBool  ("autoblink", autoBlinkEnabled);
  prefs.putULong ("blinkint",  autoBlinkInterval);
  prefs.end();
  stateDirty = false;
  Serial.println(F("[NVS] state saved"));
}

inline void markStateDirty() {
  stateDirty = true;
  lastStateChange = millis();
}

// ═══════════════════════════════════════════════════════════════════════
//  LED animations (без изменений)
// ═══════════════════════════════════════════════════════════════════════

uint32_t colorWheel(byte wheelPos) {
  wheelPos = 255 - wheelPos;
  if (wheelPos < 85)  return strip.Color(255 - wheelPos * 3, 0, wheelPos * 3);
  if (wheelPos < 170) {
    wheelPos -= 85;
    return strip.Color(0, wheelPos * 3, 255 - wheelPos * 3);
  }
  wheelPos -= 170;
  return strip.Color(wheelPos * 3, 255 - wheelPos * 3, 0);
}

