OneToThreeCreator/Unitree_g1_edu_control_panel/head_unitree_custom/src/esp32_control_light.cpp
void animOff()         { strip.clear(); strip.show(); }
void animStatic()      { strip.fill(staticColor); strip.show(); }
void animRainbow() {
  for (int i = 0; i < LED_COUNT; i++)
    strip.setPixelColor(i, colorWheel((animStep + i * 256 / LED_COUNT) & 255));
  strip.show();
}
void animRainbowCycle() {
  for (int i = 0; i < LED_COUNT; i++)
    strip.setPixelColor(i, colorWheel(((animStep * 5) + i * 256 / LED_COUNT) & 255));
  strip.show();
}
void animChase() {
  strip.clear();
  for (int i = 0; i < 3; i++)
    strip.setPixelColor((animStep + i) % LED_COUNT, staticColor);
  for (int i = 0; i < LED_COUNT; i++)
    if (i != animStep % LED_COUNT && i != (animStep + 1) % LED_COUNT && i != (animStep + 2) % LED_COUNT)
      strip.setPixelColor(i, bgColor);
  strip.show();
}
void animBreathing() {
  float t = (sin(animStep * 0.08) + 1.0) * 0.5;
  uint8_t r = ((staticColor >> 16) & 0xFF) * t;
  uint8_t g = ((staticColor >> 8)  & 0xFF) * t;
  uint8_t b = ( staticColor        & 0xFF) * t;
  strip.fill(strip.Color(r, g, b));
  strip.show();
}
void animTheater() {
  strip.fill(bgColor);
  for (int i = animStep % 3; i < LED_COUNT; i += 3)
    strip.setPixelColor(i, staticColor);
  strip.show();
}
void animWipe() {
  int fc = animStep % (LED_COUNT * 2);
  if (fc < LED_COUNT) {
    for (int i = 0; i <= fc; i++)           strip.setPixelColor(i, staticColor);
    for (int i = fc + 1; i < LED_COUNT; i++) strip.setPixelColor(i, bgColor);
  } else {
    int c = fc - LED_COUNT;
    for (int i = 0; i < LED_COUNT - c - 1; i++) strip.setPixelColor(i, staticColor);
    for (int i = LED_COUNT - c - 1; i < LED_COUNT; i++) strip.setPixelColor(i, bgColor);
  }
  strip.show();
}
void animScanner() {
  strip.fill(bgColor);
  int pos = (sin(animStep * 0.12) + 1.0) * 0.5 * (LED_COUNT - 1);
  strip.setPixelColor(pos, staticColor);
  uint32_t dim = strip.Color(((staticColor >> 16) & 0xFF) / 3,
                              ((staticColor >> 8)  & 0xFF) / 3,
                              ( staticColor        & 0xFF) / 3);
  if (pos > 0)           strip.setPixelColor(pos - 1, dim);
  if (pos < LED_COUNT-1) strip.setPixelColor(pos + 1, dim);
  strip.show();
}
void animDualColor() {
  for (int i = 0; i < LED_COUNT; i++)
    strip.setPixelColor(i, (i + animStep) % 2 ? staticColor : bgColor);
  strip.show();
}

void updateAnimation() {
  if (millis() - lastAnimStep < (unsigned long)animationSpeed) return;
  lastAnimStep = millis();
  animStep++;
  strip.setBrightness(ledBrightness);
  if      (currentAnimation == "off")            animOff();
  else if (currentAnimation == "static")         animStatic();
  else if (currentAnimation == "rainbow")        animRainbow();
  else if (currentAnimation == "rainbow_cycle")  animRainbowCycle();
  else if (currentAnimation == "chase")          animChase();
  else if (currentAnimation == "breathing")      animBreathing();
  else if (currentAnimation == "theater")        animTheater();
  else if (currentAnimation == "wipe")           animWipe();
  else if (currentAnimation == "scanner")        animScanner();
  else if (currentAnimation == "dual")           animDualColor();
  else                                            animOff();
}

// ═══════════════════════════════════════════════════════════════════════
//  Servo helpers (с инверсией для правого глаза в UI)
// ═══════════════════════════════════════════════════════════════════════

#if ENABLE_SERVOS
void attachServos() {
  if (servo1Enabled) {
    servo1.attach(SERVO1_PIN, SERVO_MIN_US, SERVO_MAX_US);
    servo1.write(servo1Angle);
  }
  if (servo2Enabled) {
    servo2.attach(SERVO2_PIN, SERVO_MIN_US, SERVO_MAX_US);
    servo2.write(servo2Angle);
  }
}

void setServo(int which, int angle) {
  angle = constrain(angle, 0, 180);
  if (which == 1) {
    servo1Angle = angle;
    if (servo1Enabled) servo1.write(angle);
  } else {
    servo2Angle = angle;
    if (servo2Enabled) servo2.write(angle);
  }
  markStateDirty();
}

void enableServo(int which, bool enabled) {
  if (which == 1) {
    servo1Enabled = enabled;
    if (enabled) { servo1.attach(SERVO1_PIN, SERVO_MIN_US, SERVO_MAX_US); servo1.write(servo1Angle); }
    else         { servo1.detach(); }
  } else {
    servo2Enabled = enabled;
    if (enabled) { servo2.attach(SERVO2_PIN, SERVO_MIN_US, SERVO_MAX_US); servo2.write(servo2Angle); }
    else         { servo2.detach(); }
  }
  markStateDirty();
}

// ── Macro scheduler ────────────────────────────────────────────────────
void addStep(int idx, unsigned long d, uint8_t w, int a) {
  if (idx < MACRO_MAX_STEPS) {
    macro.steps[idx].delayMs = d;
    macro.steps[idx].which   = w;
    macro.steps[idx].angle   = a;
  }
}

unsigned long macroDelay() {
  int s = constrain(servoSpeed, 1, 100);
  return (unsigned long)map(s, 1, 100, 400, 50);
}

int eyeOpen(uint8_t which)   { return which == 1 ? EYE_LEFT_OPEN   : EYE_RIGHT_OPEN;   }
int eyeClosed(uint8_t which) { return which == 1 ? EYE_LEFT_CLOSED : EYE_RIGHT_CLOSED;  }
int eyeMid(uint8_t which)    { return (eyeOpen(which) + eyeClosed(which)) / 2;          }


void startMacro(const String& name) {
  macro.stepCount = 0;
  macro.curStep   = 0;
  macro.active    = false;
  macro.name      = name;

  const unsigned long d = macroDelay();
  int i = 0;

  if (name == "center") {
    addStep(i++, 0, 1, eyeMid(1));
    addStep(i++, 0, 2, eyeMid(2));
  }
  else if (name == "home" || name == "open") {
    addStep(i++, 0, 1, eyeOpen(1));
    addStep(i++, 0, 2, eyeOpen(2));
  }
  else if (name == "close") {
    addStep(i++, 0, 1, eyeClosed(1));
    addStep(i++, 0, 2, eyeClosed(2));
  }
  else if (name == "blink_left") {
    addStep(i++, 0, 1, eyeClosed(1));
    addStep(i++, d, 1, eyeOpen(1));
  }
  else if (name == "blink_right") {
    addStep(i++, 0, 2, eyeClosed(2));
    addStep(i++, d, 2, eyeOpen(2));
  }
  else if (name == "blink_both") {
    addStep(i++, 0, 1, eyeClosed(1));
    addStep(i++, 0, 2, eyeClosed(2));
    addStep(i++, d, 1, eyeOpen(1));
    addStep(i++, 0, 2, eyeOpen(2));
    addStep(i++, d, 1, eyeClosed(1));
    addStep(i++, 0, 2, eyeClosed(2));
    addStep(i++, d, 1, eyeOpen(1));
    addStep(i++, 0, 2, eyeOpen(2));
  }
  else if (name == "wink") {
    addStep(i++, 0, 1, eyeClosed(1));
    addStep(i++, d, 1, eyeOpen(1));
    addStep(i++, d, 2, eyeClosed(2));
    addStep(i++, d, 2, eyeOpen(2));
    addStep(i++, d, 1, eyeClosed(1));
    addStep(i++, 0, 2, eyeClosed(2));
    addStep(i++, d, 1, eyeOpen(1));
    addStep(i++, 0, 2, eyeOpen(2));
  }
  else if (name == "blink_single") {
    // Новая задержка, зависящая от скорости
    unsigned long blinkDelay = map(servoSpeed, 1, 100, 400, 80);
    addStep(i++, 0, 1, eyeClosed(1));
    addStep(i++, 0, 2, eyeClosed(2));
    addStep(i++, blinkDelay, 1, eyeOpen(1));
    addStep(i++, 0, 2, eyeOpen(2));
    addStep(i++, blinkDelay, 1, eyeOpen(1)); // пауза после открытия
    addStep(i++, 0, 2, eyeOpen(2));
  }
  else {
    Serial.printf("[Macro] unknown: %s\n", name.c_str());
    return;
  }

  macro.stepCount = i;
  macro.active = true;
  macro.stepStartTime = millis();
  Serial.printf("[Macro] start: %s (%d steps)\n", name.c_str(), macro.stepCount);
}


