OneToThreeCreator/Unitree_g1_edu_control_panel/head_unitree_custom/src/esp32_control_light.cpp
void updateMacro() {
  if (!macro.active) return;
  unsigned long now = millis();
  if (now - macro.stepStartTime < macro.steps[macro.curStep].delayMs) return;

  const MacroStep& s = macro.steps[macro.curStep];
  if (s.which == 3) {
    setServo(1, s.angle);
    setServo(2, s.angle);
  } else {
    setServo(s.which, s.angle);
  }

  macro.curStep++;
  macro.stepStartTime = now;
  if (macro.curStep >= macro.stepCount) {
    Serial.printf("[Macro] done: %s\n", macro.name.c_str());
    macro.active = false;
    macro.name = "";
  }
}

void stopMacro() {
  if (macro.active) {
    Serial.println(F("[Macro] stopped"));
  }
  macro.active = false;
  macro.name = "";
  macro.curStep = 0;
  macro.stepCount = 0;
}
#endif

// ═══════════════════════════════════════════════════════════════════════
//  WebSocket state send (с инверсией для правого серво)
// ═══════════════════════════════════════════════════════════════════════

void sendState(uint8_t clientNum) {
  StaticJsonDocument<1024> doc;
  doc["type"] = "state";

  JsonObject features = doc.createNestedObject("features");
  features["servos"]  = (bool)ENABLE_SERVOS;

  doc["animation"]  = currentAnimation;
  char hex[8];
  snprintf(hex, sizeof(hex), "#%06X", staticColor);
  doc["color"]      = hex;
  snprintf(hex, sizeof(hex), "#%06X", bgColor);
  doc["color2"]     = hex;
  doc["brightness"] = ledBrightness;
  doc["speed"]      = animationSpeed;

#if ENABLE_SERVOS
  doc["servo1_angle"]   = servo1Angle;
  // Инверсия для правого: отображаем 180 - физический угол
  doc["servo2_angle"]   = 180 - servo2Angle;
  doc["servo1_enabled"] = servo1Enabled;
  doc["servo2_enabled"] = servo2Enabled;
  doc["servo_speed"]    = servoSpeed;
#endif

  doc["auto_blink_enabled"] = autoBlinkEnabled;
  doc["auto_blink_interval"] = autoBlinkInterval / 1000; // в секундах

  doc["heap_free"]  = ESP.getFreeHeap();
  doc["uptime_sec"] = (long)(millis() / 1000);
  doc["wifi_rssi"] = WiFi.RSSI();

  String response;
  serializeJson(doc, response);
  webSocket.sendTXT(clientNum, response);
}

void broadcastState() {
  StaticJsonDocument<1024> doc;
  doc["type"] = "state";
  doc["animation"]  = currentAnimation;
  char hex[8];
  snprintf(hex, sizeof(hex), "#%06X", staticColor);  doc["color"] = hex;
  snprintf(hex, sizeof(hex), "#%06X", bgColor);      doc["color2"] = hex;
  doc["brightness"] = ledBrightness;
  doc["speed"]      = animationSpeed;
#if ENABLE_SERVOS
  doc["servo1_angle"]   = servo1Angle;
  doc["servo2_angle"]   = 180 - servo2Angle; // инверсия
  doc["servo1_enabled"] = servo1Enabled;
  doc["servo2_enabled"] = servo2Enabled;
  doc["servo_speed"]    = servoSpeed;
#endif
  doc["auto_blink_enabled"] = autoBlinkEnabled;
  doc["auto_blink_interval"] = autoBlinkInterval / 1000;
  doc["heap_free"]    = ESP.getFreeHeap();
  doc["uptime_sec"]   = (long)(millis() / 1000);
  doc["wifi_rssi"] = WiFi.RSSI();
  String response;
  serializeJson(doc, response);
  webSocket.broadcastTXT(response);
}

// ═══════════════════════════════════════════════════════════════════════
//  WebSocket message handler
// ═══════════════════════════════════════════════════════════════════════

void handleWebSocketMessage(uint8_t clientNum, const char* payload) {
  StaticJsonDocument<512> doc;
  if (deserializeJson(doc, payload)) {
    Serial.println(F("[WS] JSON parse failed"));
    return;
  }
  String cmd = doc["cmd"] | "";

  if (cmd == "get_state")            { sendState(clientNum); return; }

  if (cmd == "led_animation") {
    currentAnimation = doc["name"] | "off";
    animStep = 0;
    markStateDirty();
    return;
  }
  if (cmd == "led_color") {
    String hex = doc["color"] | "#ff00ff";
    long rgb = strtol(hex.c_str() + 1, nullptr, 16);
    staticColor = strip.Color((rgb >> 16) & 0xFF, (rgb >> 8) & 0xFF, rgb & 0xFF);
    markStateDirty();
    return;
  }
  if (cmd == "led_color2") {
    String hex = doc["color"] | "#000000";
    long rgb = strtol(hex.c_str() + 1, nullptr, 16);
    bgColor = strip.Color((rgb >> 16) & 0xFF, (rgb >> 8) & 0xFF, rgb & 0xFF);
    markStateDirty();
    return;
  }
  if (cmd == "led_brightness") {
    ledBrightness = constrain((int)(doc["value"] | 80), 0, 255);
    markStateDirty();
    return;
  }
  if (cmd == "led_speed") {
    animationSpeed = constrain((int)(doc["value"] | 50), 10, 500);
    markStateDirty();
    return;
  }

#if ENABLE_SERVOS
  if (cmd == "servo") {
    int which = doc["which"] | 0;
    int angle = doc["angle"] | -1;
    if (which > 0 && angle >= 0) {
      if (which == 2) angle = 180 - angle; // инверсия
      setServo(which, angle);
    }
    return;
  }
  if (cmd == "servo_both") {
    int angle = doc["angle"] | -1;
    if (angle >= 0) {
      setServo(1, angle);
      setServo(2, 180 - angle); // инверсия для правого
    }
    return;
  }
  if (cmd == "servo_enable") {
    int which = doc["which"] | 0;
    bool en   = doc["enabled"] | false;
    if (which > 0) enableServo(which, en);
    return;
  }
  if (cmd == "servo_preset") {
    int which = doc["which"] | 0;
    int angle = doc["angle"] | -1;
    if (which > 0 && angle >= 0) {
      if (which == 2) angle = 180 - angle;
      setServo(which, angle);
    }
    return;
  }
  if (cmd == "servo_macro") {
    String name = doc["name"] | "";
    if (name.length() > 0) startMacro(name);
    return;
  }
  if (cmd == "servo_macro_stop") {
    stopMacro();
    return;
  }
  if (cmd == "servo_speed") {
    servoSpeed = constrain((int)(doc["value"] | DEFAULT_SERVO_SPEED), 1, 100);
    markStateDirty();
    return;
  }
  // Автоматическое моргание
  if (cmd == "auto_blink") {
    if (doc.containsKey("enabled")) {
      autoBlinkEnabled = doc["enabled"] | false;
      if (!autoBlinkEnabled) stopMacro(); // останавливаем текущий макрос
      markStateDirty();
    }
    if (doc.containsKey("interval")) {
      int sec = doc["interval"] | 3;
      if (sec < 1) sec = 1;
      if (sec > 10) sec = 10;
      autoBlinkInterval = sec * 1000UL;
      markStateDirty();
    }
    return;
  }
  if (cmd == "blink_now") {
    // Ручное моргание (один раз)
    if (!macro.active) {
      startMacro("blink_single");
    }
    return;
  }
#endif

