OneToThreeCreator/Unitree_g1_edu_control_panel/head_unitree_custom/src/esp32_control_light.cpp
#if !ENABLE_SERVOS
  if (cmd == "servo" || cmd == "servo_both" || cmd == "servo_enable" ||
      cmd == "servo_preset" || cmd == "servo_macro" || cmd == "servo_macro_stop" ||
      cmd == "servo_speed" || cmd == "auto_blink" || cmd == "blink_now") {
    StaticJsonDocument<128> err;
    err["type"]    = "error";
    err["message"] = "servos disabled in firmware";
    String r; serializeJson(err, r);
    webSocket.sendTXT(clientNum, r);
    return;
  }
#endif

  if (cmd == "reboot") {
    if (millis() - lastRebootRequest < 3000) {
      Serial.println(F("[CMD] reboot ignored (too soon)"));
      return;
    }
    lastRebootRequest = millis();
    Serial.println(F("[CMD] reboot in 500ms"));
    delay(500);
    ESP.restart();
    return;
  }

  Serial.printf("[WS] unknown cmd: %s\n", cmd.c_str());
}

// ═══════════════════════════════════════════════════════════════════════
//  WebSocket event handler (без изменений)
// ═══════════════════════════════════════════════════════════════════════

void onWebSocketEvent(uint8_t clientNum, WStype_t type, uint8_t* payload, size_t length) {
  switch (type) {
    case WStype_DISCONNECTED:
      if (wsClientCount > 0) wsClientCount--;
      wsResetClient(clientNum);
      Serial.printf("[WS] #%u disconnected (now %d)\n", clientNum, wsClientCount);
      break;
    case WStype_CONNECTED: {
      if (wsClientCount >= MAX_WS_CLIENTS) {
        Serial.printf("[WS] #%u rejected (limit %d)\n", clientNum, MAX_WS_CLIENTS);
        StaticJsonDocument<128> err;
        err["type"]    = "error";
        err["message"] = "max clients reached";
        String r; serializeJson(err, r);
        webSocket.sendTXT(clientNum, r);
        delay(50);
        webSocket.disconnect(clientNum);
        return;
      }
      if (ESP.getFreeHeap() < 30 * 1024) {
        Serial.printf("[WS] #%u rejected (low heap: %u)\n", clientNum, ESP.getFreeHeap());
        StaticJsonDocument<128> err;
        err["type"]    = "error";
        err["message"] = "low heap, try later";
        String r; serializeJson(err, r);
        webSocket.sendTXT(clientNum, r);
        delay(50);
        webSocket.disconnect(clientNum);
        return;
      }
      wsClientCount++;
      wsClients[clientNum].active = true;
      wsClients[clientNum].firstMsgTime = millis();
      wsClients[clientNum].msgCount = 0;
      Serial.printf("[WS] #%u connected (now %d, heap %u)\n",
                    clientNum, wsClientCount, ESP.getFreeHeap());
      sendState(clientNum);
      break;
    }
    case WStype_TEXT:
      if (length > 1024) {
        Serial.printf("[WS] #%u oversized payload (%u bytes), dropping\n", clientNum, length);
        StaticJsonDocument<128> err;
        err["type"]    = "error";
        err["message"] = "payload too large";
        String r; serializeJson(err, r);
        webSocket.sendTXT(clientNum, r);
        return;
      }
      if (!wsRateLimitOk(clientNum)) {
        Serial.printf("[WS] #%u rate-limited, dropping\n", clientNum);
        webSocket.disconnect(clientNum);
        return;
      }
      handleWebSocketMessage(clientNum, (const char*)payload);
      break;
    default: break;
  }
}

// ═══════════════════════════════════════════════════════════════════════
//  HTTP server (добавлена поддержка новых полей в /state)
// ═══════════════════════════════════════════════════════════════════════

extern const char INDEX_HTML[] PROGMEM;

void setupHTTP() {
  server.on("/", HTTP_GET, [](AsyncWebServerRequest* req) {
    if (!httpRateLimitOk(req)) { req->send(429, "text/plain", "rate limit"); return; }
    req->send(200, "text/html", INDEX_HTML);
  });

  server.on("/state", HTTP_GET, [](AsyncWebServerRequest* req) {
    if (!httpRateLimitOk(req)) { req->send(429, "text/plain", "rate limit"); return; }
    AsyncResponseStream* resp = req->beginResponseStream("application/json");
    resp->printf("{");
    resp->printf("\"animation\":\"%s\",", currentAnimation.c_str());
    resp->printf("\"brightness\":%d,", ledBrightness);
    resp->printf("\"speed\":%d,", animationSpeed);
    resp->printf("\"color\":\"#%06X\",", staticColor);
    resp->printf("\"color2\":\"#%06X\",", bgColor);
    resp->printf("\"features\":{\"servos\":%s},", ENABLE_SERVOS ? "true" : "false");
    resp->printf("\"servo1_angle\":%d,", servo1Angle);
    resp->printf("\"servo2_angle\":%d,", 180 - servo2Angle); // инверсия
    resp->printf("\"servo1_enabled\":%s,", servo1Enabled ? "true" : "false");
    resp->printf("\"servo2_enabled\":%s,", servo2Enabled ? "true" : "false");
    resp->printf("\"servo_speed\":%d,", servoSpeed);
    resp->printf("\"auto_blink_enabled\":%s,", autoBlinkEnabled ? "true" : "false");
    resp->printf("\"auto_blink_interval\":%u,", autoBlinkInterval / 1000);
    resp->printf("\"heap_free\":%u,", ESP.getFreeHeap());
    resp->printf("\"uptime_sec\":%lu,", millis() / 1000);
    resp->printf("\"wifi_rssi\":%d,", WiFi.RSSI());
    resp->printf("\"flash_size\":%u", ESP.getFlashChipSize());
    resp->printf("}");
    req->send(resp);
  });

  server.on("/team.jpg", HTTP_GET, [](AsyncWebServerRequest* req) {
    if (!httpRateLimitOk(req)) { req->send(429, "text/plain", "rate limit"); return; }
    if (LittleFS.exists("/team.jpg")) {
      AsyncWebServerResponse* r = req->beginResponse(LittleFS, "/team.jpg", "image/jpeg");
      r->addHeader("Cache-Control", "max-age=86400");
      req->send(r);
    } else {
      req->send(404, "text/plain", "team.jpg not uploaded");
    }
  });

  server.on("/reboot", HTTP_POST, [](AsyncWebServerRequest* req) {
    if (!httpRateLimitOk(req)) { req->send(429, "text/plain", "rate limit"); return; }
    if (millis() - lastRebootRequest < 3000) {
      req->send(429, "application/json", "{\"ok\":false,\"error\":\"cooldown\"}");
      return;
    }
    lastRebootRequest = millis();
    req->send(200, "application/json", "{\"ok\":true}");
    Serial.println(F("[HTTP] reboot in 500ms"));
    delay(500);
    ESP.restart();
  });

  server.onNotFound([](AsyncWebServerRequest* req) {
    req->send(404, "text/plain", "Not Found");
  });

  server.begin();
  Serial.println(F("[HTTP] server on :80"));
}

