OneToThreeCreator/Unitree_g1_edu_control_panel/head_unitree_custom/src/esp32_control_light.cpp
// ═══════════════════════════════════════════════════════════════════════
//  OTA (без изменений)
// ═══════════════════════════════════════════════════════════════════════

void setupOTA() {
  ArduinoOTA.setHostname(MDNS_NAME);
  ArduinoOTA.setPassword("ota-esp32");
  ArduinoOTA
    .onStart([]() { Serial.println(F("[OTA] start")); })
    .onEnd([]()   { Serial.println(F("\n[OTA] end")); })
    .onProgress([](unsigned int p, unsigned int t) {
      Serial.printf("[OTA] %u/%u (%u%%)\r", p, t, (p * 100) / t);
    })
    .onError([](ota_error_t e) {
      Serial.printf("[OTA] error %u\n", e);
    });
  ArduinoOTA.begin();
  Serial.println(F("[OTA] ready (password: ota-esp32)"));
}

// ═══════════════════════════════════════════════════════════════════════
//  WiFi + mDNS (без изменений)
// ═══════════════════════════════════════════════════════════════════════

void setupWiFi() {
  WiFi.mode(WIFI_STA);
  WiFi.begin(STA_SSID, STA_PASS);
  Serial.printf("[WiFi] Connecting to %s", STA_SSID);
  int attempts = 0;
  while (WiFi.status() != WL_CONNECTED && attempts < 40) {
    delay(500);
    Serial.print(".");
    attempts++;
  }
  if (WiFi.status() == WL_CONNECTED) {
    Serial.printf("\n[WiFi] Connected! IP: %s  RSSI: %d dBm\n",
                  WiFi.localIP().toString().c_str(), WiFi.RSSI());
  } else {
    // Fallback to AP mode for debugging
    Serial.println("\n[WiFi] STA failed, starting AP fallback");
    WiFi.mode(WIFI_AP);
    WiFi.softAP(AP_FALLBACK_SSID, AP_FALLBACK_PASS);
    Serial.printf("[WiFi] AP SSID: %s\n", AP_FALLBACK_SSID);
    Serial.printf("[WiFi] AP IP:   %s\n", WiFi.softAPIP().toString().c_str());
  }

  if (!MDNS.begin(MDNS_NAME)) {
    Serial.println(F("[mDNS] failed"));
  } else {
    MDNS.addService("http", "tcp", 80);
    Serial.printf("[mDNS] http://%s.local\n", MDNS_NAME);
  }
}

// ═══════════════════════════════════════════════════════════════════════
//  Hardening (без изменений)
// ═══════════════════════════════════════════════════════════════════════

void setupWDT() {
  esp_task_wdt_init(10, true);
  esp_task_wdt_add(NULL);
  Serial.println(F("[WDT] watchdog 10s"));
}

void wdtFeed() {
  esp_task_wdt_reset();
}

bool wsRateLimitOk(uint8_t clientNum) {
  if (clientNum >= 8) return false;
  WsClientInfo& c = wsClients[clientNum];
  unsigned long now = millis();
  if (now - c.firstMsgTime > 1000) {
    c.firstMsgTime = now;
    c.msgCount = 0;
  }
  c.msgCount++;
  c.lastMsgTime = now;
  return c.msgCount <= 50;
}

void wsResetClient(uint8_t clientNum) {
  if (clientNum < 8) {
    wsClients[clientNum].active = false;
    wsClients[clientNum].msgCount = 0;
  }
}

bool httpRateLimitOk(AsyncWebServerRequest* req) {
  IPAddress ip = req->client()->remoteIP();
  unsigned long now = millis();
  HttpRateEntry* slot = nullptr;
  for (int i = 0; i < 16; i++) {
    if (httpRate[i].count == 0) { slot = &httpRate[i]; break; }
    if (httpRate[i].ip == ip)   { slot = &httpRate[i]; break; }
  }
  if (!slot) slot = &httpRate[0];
  if (now - slot->windowStart > HTTP_RATE_WINDOW) {
    slot->windowStart = now;
    slot->count = 0;
  }
  slot->ip = ip;
  slot->count++;
  return slot->count <= HTTP_RATE_MAX;
}

// ═══════════════════════════════════════════════════════════════════════
//  Setup / Loop
// ═══════════════════════════════════════════════════════════════════════

void setup() {
  Serial.begin(115200);
  delay(200);
  Serial.println(F("\n=== Umnaya golova Kuzmicha (ESP32-C3) ==="));

  loadState();

  if (!LittleFS.begin(true)) {
    Serial.println(F("[FS] LittleFS mount failed"));
  } else {
    Serial.printf("[FS] LittleFS ok, team.jpg: %s\n",
                  LittleFS.exists("/team.jpg") ? "found" : "missing");
  }

  strip.begin();
  strip.setBrightness(ledBrightness);
  strip.fill(strip.Color(30, 30, 30));
  strip.show();
  Serial.println(F("[LED] ready"));

#if ENABLE_SERVOS
  ESP32PWM::allocateTimer(0);
  ESP32PWM::allocateTimer(1);
  servo1.setPeriodHertz(SERVO_FREQ);
  servo2.setPeriodHertz(SERVO_FREQ);
  attachServos();
  Serial.println(F("[Servo] ready"));
#else
  Serial.println(F("[Servo] disabled in firmware"));
#endif

  setupWiFi();
  setupHTTP();
  setupOTA();
  setupWDT();

  WiFi.setTxPower(WIFI_POWER_17dBm);

  webSocket.begin();
  webSocket.onEvent(onWebSocketEvent);
  Serial.println(F("[WS] server on :81"));

  Serial.println(F("=== Ready ==="));
}

void loop() {
  webSocket.loop();
  ArduinoOTA.handle();
  updateAnimation();
#if ENABLE_SERVOS
  updateMacro();
  // Автоматическое моргание
  if (autoBlinkEnabled && !macro.active) {
    if (millis() - lastBlinkTime >= autoBlinkInterval) {
      startMacro("blink_single");
      lastBlinkTime = millis();
    }
  }
#endif
  wdtFeed();

  if (stateDirty && (millis() - lastStateChange > STATE_SAVE_MS)) {
    saveState();
  }

  if (millis() - lastHeartbeat > 5000) {
    lastHeartbeat = millis();
    if (wsClientCount > 0) {
      StaticJsonDocument<256> doc;
      doc["type"]         = "heartbeat";
      doc["heap_free"]    = ESP.getFreeHeap();
      doc["uptime_sec"]   = (long)(millis() / 1000);
      doc["wifi_rssi"] = WiFi.RSSI();
      String r; serializeJson(doc, r);
      webSocket.broadcastTXT(r);
    }
  }

  yield();
}

// ═══════════════════════════════════════════════════════════════════════
//  Embedded HTML (обновлён: добавлен блок «Моргание»)
// ═══════════════════════════════════════════════════════════════════════

const char INDEX_HTML[] PROGMEM = R"HTML(
<!DOCTYPE html>
<html lang="ru">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0">
<title>Управление умной головой Кузьмича</title>
<style>
  * { margin: 0; padding: 0; box-sizing: border-box; -webkit-tap-highlight-color: transparent; }
  :root {
    --bg-0: #060608;
    --glass: rgba(255,255,255,0.04);
    --glass-bd: rgba(255,255,255,0.08);
    --text: #e8e8f0;
    --text-dim: #8888a0;
    --accent: #a855f7;
    --accent-2: #ec4899;
    --accent-3: #06b6d4;
    --success: #10b981;
    --warn: #f59e0b;
    --danger: #ef4444;
    --radius: 16px;
  }
  html, body {
    min-height: 100vh; background: var(--bg-0); color: var(--text);
    font-family: -apple-system, BlinkMacSystemFont, 'SF Pro Display', 'Segoe UI', system-ui, sans-serif;
    overflow-x: hidden;
  }
  body {
    background:
      radial-gradient(circle at 0% 0%, rgba(168,85,247,0.18), transparent 40%),
      radial-gradient(circle at 100% 0%, rgba(236,72,153,0.15), transparent 40%),
      radial-gradient(circle at 50% 100%, rgba(6,182,212,0.12), transparent 50%),
      var(--bg-0);
    padding: 16px; padding-bottom: 80px;
  }
  .orbs { position: fixed; inset: 0; z-index: -1; pointer-events: none; overflow: hidden; }
  .orb { position: absolute; border-radius: 50%; filter: blur(80px); opacity: 0.35; animation: float 20s ease-in-out infinite; }
  .orb:nth-child(1) { width: 400px; height: 400px; background: #a855f7; top: -100px; left: -100px; }
  .orb:nth-child(2) { width: 350px; height: 350px; background: #ec4899; top: 30%; right: -120px; animation-delay: -5s; }
  .orb:nth-child(3) { width: 300px; height: 300px; background: #06b6d4; bottom: -80px; left: 30%; animation-delay: -10s; }
  @keyframes float {
    0%,100% { transform: translate(0,0) scale(1); }
    33% { transform: translate(30px, -50px) scale(1.1); }
    66% { transform: translate(-20px, 30px) scale(0.9); }
  }
  header { text-align: center; margin-bottom: 24px; padding-top: 16px; }
  header h1 {
    font-size: clamp(1.6rem, 4vw, 2.2rem); font-weight: 800;
    background: linear-gradient(135deg, #a855f7 0%, #ec4899 50%, #06b6d4 100%);
    -webkit-background-clip: text; background-clip: text; -webkit-text-fill-color: transparent;
    letter-spacing: -0.02em; margin-bottom: 6px;
  }
  header p { color: var(--text-dim); font-size: 0.85rem; font-weight: 500; }
  .status-pill {
    display: inline-flex; align-items: center; gap: 8px;
    padding: 6px 14px; background: var(--glass); border: 1px solid var(--glass-bd);
    border-radius: 99px; font-size: 0.78rem; margin-top: 10px; backdrop-filter: blur(10px);
  }
  .status-dot { width: 8px; height: 8px; border-radius: 50%; background: var(--danger); transition: background 0.3s; }
  .status-dot.connected { background: var(--success); box-shadow: 0 0 12px var(--success); animation: pulse 2s ease-in-out infinite; }
  @keyframes pulse { 50% { transform: scale(1.3); } }
  .grid { display: grid; grid-template-columns: 1fr; gap: 16px; max-width: 1100px; margin: 0 auto; }
  @media (min-width: 768px) {
    .grid { grid-template-columns: 1fr 1fr; }
    .grid .led-card, .grid .metrics-card { grid-column: 1 / -1; }
  }
  .card {
    background: var(--glass); border: 1px solid var(--glass-bd);
    border-radius: var(--radius); padding: 20px; backdrop-filter: blur(20px);
  }
  .card-title { font-size: 1.1rem; font-weight: 700; margin-bottom: 4px; }
  .card-subtitle { color: var(--text-dim); font-size: 0.78rem; margin-bottom: 16px; }
  .hidden { display: none !important; }
  .badge {
    display: inline-block; padding: 2px 8px; border-radius: 6px;
    background: rgba(245,158,11,0.15); color: var(--warn);
    font-size: 0.68rem; font-weight: 600; margin-left: 8px; vertical-align: middle;
  }
  .anim-grid { display: grid; grid-template-columns: repeat(3, 1fr); gap: 8px; margin-bottom: 16px; }
  .anim-btn {
    padding: 10px 4px; background: var(--glass); border: 1px solid var(--glass-bd);
    border-radius: 10px; color: var(--text); font-size: 0.78rem; font-weight: 600;
    cursor: pointer; transition: all 0.2s; text-transform: capitalize;
  }
  .anim-btn:hover { border-color: var(--accent); background: rgba(168,85,247,0.1); }
  .anim-btn.active {
    background: linear-gradient(135deg, var(--accent), var(--accent-2));
    border-color: transparent; color: white; box-shadow: 0 4px 16px rgba(168,85,247,0.4);
  }
  .control-row { margin-bottom: 14px; }
  .control-label {
    display: flex; justify-content: space-between; align-items: center;
    margin-bottom: 6px; font-size: 0.85rem; color: var(--text-dim); font-weight: 500;
  }
  .control-value { color: var(--accent-3); font-weight: 700; font-variant-numeric: tabular-nums; }
  input[type="range"] {
    -webkit-appearance: none; width: 100%; height: 6px; border-radius: 3px;
    background: rgba(255,255,255,0.08); outline: none;
  }
  input[type="range"]::-webkit-slider-thumb {
    -webkit-appearance: none; width: 22px; height: 22px; border-radius: 50%;
    background: linear-gradient(135deg, var(--accent), var(--accent-2));
    cursor: pointer; box-shadow: 0 0 12px rgba(168,85,247,0.6); border: 2px solid white;
  }
  input[type="range"]::-moz-range-thumb {
    width: 22px; height: 22px; border-radius: 50%; border: 2px solid white;
    background: linear-gradient(135deg, var(--accent), var(--accent-2)); cursor: pointer;
  }
  .color-row { display: flex; gap: 12px; align-items: center; margin-bottom: 12px; }
  .color-picker-wrap { display: flex; flex-direction: column; align-items: center; gap: 4px; }
  .color-picker-wrap span { font-size: 0.7rem; color: var(--text-dim); }
  input[type="color"] {
    width: 56px; height: 56px; border: none; border-radius: 12px; cursor: pointer;
    background: transparent; padding: 0;
  }
  input[type="color"]::-webkit-color-swatch-wrapper { padding: 0; }
  input[type="color"]::-webkit-color-swatch { border: 2px solid var(--glass-bd); border-radius: 12px; }
  .btn {
    padding: 8px 16px; background: var(--glass); border: 1px solid var(--glass-bd);
    border-radius: 10px; color: var(--text); font-size: 0.85rem; font-weight: 600;
    cursor: pointer; transition: all 0.2s;
  }
  .btn:hover { border-color: var(--accent); background: rgba(168,85,247,0.1); }
  .btn.danger { color: var(--danger); }
  .btn.danger:hover { border-color: var(--danger); background: rgba(239,68,68,0.1); }
  .toggle {
    position: relative; width: 44px; height: 24px; background: rgba(255,255,255,0.08);
    border-radius: 12px; cursor: pointer; transition: background 0.2s;
  }
  .toggle::after {
    content: ''; position: absolute; top: 2px; left: 2px; width: 20px; height: 20px;
    border-radius: 50%; background: white; transition: transform 0.2s;
  }
  .toggle.on { background: var(--success); }
  .toggle.on::after { transform: translateX(20px); }
  .toggle-row { display: flex; justify-content: space-between; align-items: center; }
  .preset-row { display: grid; grid-template-columns: repeat(5, 1fr); gap: 6px; margin-top: 8px; }
  .preset-btn {
    padding: 6px 2px; background: var(--glass); border: 1px solid var(--glass-bd);
    border-radius: 8px; color: var(--text-dim); font-size: 0.72rem; font-weight: 600;
    cursor: pointer; transition: all 0.15s;
  }
  .preset-btn:hover { border-color: var(--accent-3); color: var(--accent-3); background: rgba(6,182,212,0.08); }
  .macro-grid {
    display: grid; grid-template-columns: repeat(3, 1fr); gap: 8px; margin-top: 14px;
    padding-top: 14px; border-top: 1px solid var(--glass-bd);
  }
  .macro-btn {
    padding: 10px 4px; background: linear-gradient(135deg, rgba(168,85,247,0.15), rgba(236,72,153,0.15));
    border: 1px solid rgba(168,85,247,0.3); border-radius: 10px;
    color: var(--text); font-size: 0.76rem; font-weight: 600; cursor: pointer;
    transition: all 0.2s; text-transform: capitalize;
  }
  .macro-btn:hover { border-color: var(--accent); box-shadow: 0 4px 16px rgba(168,85,247,0.3); }
  .macro-btn.danger { background: rgba(239,68,68,0.1); border-color: rgba(239,68,68,0.3); color: var(--danger); }
  .macro-btn.danger:hover { border-color: var(--danger); }
  .sync-row {
    display: flex; align-items: center; justify-content: space-between;
    margin-bottom: 12px; padding: 8px 12px; background: rgba(255,255,255,0.03);
    border-radius: 10px; border: 1px solid var(--glass-bd);
  }
  .sync-row span { font-size: 0.82rem; color: var(--text-dim); }
  .metrics-grid { display: grid; grid-template-columns: repeat(auto-fit, minmax(140px, 1fr)); gap: 12px; }
  .metric { background: var(--glass); border: 1px solid var(--glass-bd); border-radius: 12px; padding: 12px; }
  .metric-label { font-size: 0.7rem; color: var(--text-dim); margin-bottom: 4px; }
  .metric-value { font-size: 1.1rem; font-weight: 700; color: var(--accent-3); font-variant-numeric: tabular-nums; }
  .toast {
    position: fixed; bottom: 24px; left: 50%; transform: translateX(-50%) translateY(80px);
    padding: 12px 20px; background: rgba(20,20,28,0.95); border: 1px solid var(--glass-bd);
    border-radius: 12px; color: var(--text); font-size: 0.85rem; backdrop-filter: blur(20px);
    transition: transform 0.3s, opacity 0.3s; opacity: 0; z-index: 1000; max-width: 90vw;
  }
  .toast.show { transform: translateX(-50%) translateY(0); opacity: 1; }
  .toast.error { border-color: var(--danger); }
  .toast.success { border-color: var(--success); }
  .footer-info { text-align: center; color: var(--text-dim); font-size: 0.72rem; margin-top: 24px; }
  .palette { margin: 6px 0 14px; padding: 12px; background: rgba(255,255,255,0.03); border: 1px solid var(--glass-bd); border-radius: 12px; }
  .palette-head { display: flex; align-items: center; justify-content: space-between; margin-bottom: 10px; font-size: 0.82rem; color: var(--text-dim); font-weight: 500; }
  .palette-swatch { width: 40px; height: 24px; border-radius: 8px; border: 2px solid var(--glass-bd); background: #ff00ff; }
  .ch-r { color: #ff5a5a; } .ch-g { color: #4ade80; } .ch-b { color: #60a5fa; }
  .slider-r::-webkit-slider-thumb { background: linear-gradient(135deg,#ff5a5a,#ff0000); box-shadow: 0 0 12px rgba(255,90,90,0.6); }
  .slider-g::-webkit-slider-thumb { background: linear-gradient(135deg,#4ade80,#16a34a); box-shadow: 0 0 12px rgba(74,222,128,0.6); }
  .slider-b::-webkit-slider-thumb { background: linear-gradient(135deg,#60a5fa,#2563eb); box-shadow: 0 0 12px rgba(96,165,250,0.6); }
  .slider-r::-moz-range-thumb { background: #ff3b3b; } .slider-g::-moz-range-thumb { background: #22c55e; } .slider-b::-moz-range-thumb { background: #3b82f6; }
  /* Блок моргания */
  .blink-section {
    margin-top: 16px; padding-top: 16px; border-top: 1px solid var(--glass-bd);
  }
  .blink-row { display: flex; align-items: center; justify-content: space-between; margin-bottom: 12px; }
  .blink-row .toggle { flex-shrink: 0; }
  .team-photo-wrap { max-width: 1100px; margin: 32px auto 0; text-align: center; }
  .team-photo {
    width: 100%; max-width: 480px; height: auto; border-radius: var(--radius);
    border: 1px solid var(--glass-bd); box-shadow: 0 8px 32px rgba(0,0,0,0.4);
  }
  .signature {
    max-width: 1100px; margin: 20px auto 0; text-align: center;
    padding: 18px; background: var(--glass); border: 1px solid var(--glass-bd);
    border-radius: var(--radius); backdrop-filter: blur(20px);
  }
  .signature .love {
    font-size: 0.95rem; font-weight: 700;
    background: linear-gradient(135deg,#a855f7,#ec4899,#06b6d4);
    -webkit-background-clip: text; background-clip: text; -webkit-text-fill-color: transparent;
    margin-bottom: 6px;
  }
  .signature .team { color: var(--text-dim); font-size: 0.82rem; line-height: 1.5; }
</style>
</head>
<body>
<div class="orbs"><div class="orb"></div><div class="orb"></div><div class="orb"></div></div>

<header>
  <h1>Управление умной головой Кузьмича</h1>
  <p>Светодиоды &middot; Сервоприводы &middot; WebSocket &middot; mDNS &middot; OTA</p>
  <div class="status-pill">
    <span class="status-dot" id="statusDot"></span>
    <span id="statusText">Отключено</span>
  </div>
</header>

<div class="grid">

  <!-- LED Card -->
  <div class="card led-card">
    <div class="card-title">Светящиеся глаза</div>
    <div class="card-subtitle">LED управление &middot; GPIO10 &middot; 2&times; WS2812B панели (14 диодов)</div>

    <div class="anim-grid" id="animGrid">
      <button class="anim-btn" data-anim="off">Выкл</button>
      <button class="anim-btn" data-anim="static">Статичный</button>
      <button class="anim-btn" data-anim="rainbow">Радуга</button>
      <button class="anim-btn" data-anim="rainbow_cycle">Радуга цикл</button>
      <button class="anim-btn" data-anim="chase">Бегущий</button>
      <button class="anim-btn" data-anim="breathing">Дыхание</button>
      <button class="anim-btn" data-anim="theater">Театр</button>
      <button class="anim-btn" data-anim="wipe">Заливка</button>
      <button class="anim-btn" data-anim="scanner">Сканер</button>
      <button class="anim-btn" data-anim="dual">Двойной</button>
    </div>

    <div class="color-row">
      <div class="color-picker-wrap">
        <input type="color" id="colorPicker" value="#ff00ff">
        <span>Основной</span>
      </div>
      <div class="color-picker-wrap">
        <input type="color" id="color2Picker" value="#000000">
        <span>Фон</span>
      </div>
    </div>

    <div class="palette">
      <div class="palette-head">
        <span>Палитра основного цвета</span>
        <span class="palette-swatch" id="paletteSwatch"></span>
      </div>
      <div class="control-row">
        <div class="control-label">
          <span class="ch-r">Красный (R)</span>
          <span class="control-value" id="rVal">255</span>
        </div>
        <input type="range" id="rSlider" class="slider-r" min="0" max="255" value="255">
      </div>
      <div class="control-row">
        <div class="control-label">
          <span class="ch-g">Зелёный (G)</span>
          <span class="control-value" id="gVal">0</span>
        </div>
        <input type="range" id="gSlider" class="slider-g" min="0" max="255" value="0">
      </div>
      <div class="control-row">
        <div class="control-label">
          <span class="ch-b">Синий (B)</span>
          <span class="control-value" id="bVal">255</span>
        </div>
        <input type="range" id="bSlider" class="slider-b" min="0" max="255" value="255">
      </div>
    </div>

    <div class="control-row">
      <div class="control-label">
        <span>Яркость</span>
        <span class="control-value" id="brightnessVal">80</span>
      </div>
      <input type="range" id="brightness" min="0" max="255" value="80" data-throttle="true">
    </div>

    <div class="control-row">
      <div class="control-label">
        <span>Скорость анимации</span>
        <span class="control-value" id="speedVal">30</span>
      </div>
      <input type="range" id="speed" min="10" max="500" value="30" data-throttle="true">
    </div>
  </div>

  <!-- Servo Card -->
  <div class="card servo-card hidden" id="servoCard">
    <div class="card-title">Лючки глаз <span id="servoBadge"></span></div>
    <div class="card-subtitle">Серво &middot; GPIO4 — левый глаз &middot; GPIO2 — правый глаз (инвертирован)</div>

    <div class="sync-row">
      <span>Синхронный режим (оба глаза вместе)</span>
      <div class="toggle" id="syncToggle"></div>
    </div>

    <div class="control-row">
      <div class="control-label">
        <span>Скорость сервоприводов</span>
        <span class="control-value" id="servoSpeedVal">60</span>
      </div>
      <input type="range" id="servoSpeed" min="1" max="100" value="60">
    </div>

    <div class="control-row">
      <div class="toggle-row">
        <span>Левый глаз</span>
        <div class="toggle on" id="servo1Toggle"></div>
      </div>
      <div class="control-label">
        <span>Угол века</span>
        <span class="control-value"><span id="servo1Val">90</span>&deg;</span>
      </div>
      <input type="range" id="servo1" min="0" max="180" value="90" data-throttle="true">
      <div class="preset-row">
        <button class="preset-btn" data-servo="1" data-angle="0">0&deg;</button>
        <button class="preset-btn" data-servo="1" data-angle="45">45&deg;</button>
        <button class="preset-btn" data-servo="1" data-angle="90">90&deg;</button>
        <button class="preset-btn" data-servo="1" data-angle="135">135&deg;</button>
        <button class="preset-btn" data-servo="1" data-angle="180">180&deg;</button>
      </div>
    </div>

    <div class="control-row">
      <div class="toggle-row">
        <span>Правый глаз (инвертирован)</span>
        <div class="toggle on" id="servo2Toggle"></div>
      </div>
      <div class="control-label">
        <span>Угол века</span>
        <span class="control-value"><span id="servo2Val">90</span>&deg;</span>
      </div>
      <input type="range" id="servo2" min="0" max="180" value="90" data-throttle="true">
      <div class="preset-row">
        <button class="preset-btn" data-servo="2" data-angle="0">0&deg;</button>
        <button class="preset-btn" data-servo="2" data-angle="45">45&deg;</button>
        <button class="preset-btn" data-servo="2" data-angle="90">90&deg;</button>
        <button class="preset-btn" data-servo="2" data-angle="135">135&deg;</button>
        <button class="preset-btn" data-servo="2" data-angle="180">180&deg;</button>
      </div>
    </div>

    <div class="macro-grid">
      <button class="macro-btn" data-macro="blink_left">Подмигнуть левым</button>
      <button class="macro-btn" data-macro="blink_right">Подмигнуть правым</button>
      <button class="macro-btn" data-macro="blink_both">Моргнуть обоими</button>
      <button class="macro-btn" data-macro="wink">Подмаргивание</button>
      <button class="macro-btn" data-macro="open">Открыть глаза</button>
      <button class="macro-btn" data-macro="close">Закрыть глаза</button>
      <button class="macro-btn" data-macro="center">Центр</button>
      <button class="macro-btn" data-macro="home">Домой</button>
      <button class="macro-btn danger" data-macro="stop">Стоп</button>
    </div>

