OneToThreeCreator/Unitree_g1_edu_control_panel/head_unitree_custom/src/esp32_control_light.cpp
    <!-- Блок моргания -->
    <div class="blink-section">
      <div class="blink-row">
        <span style="font-weight:600;">Автоматическое моргание</span>
        <div class="toggle" id="autoBlinkToggle"></div>
      </div>
      <div class="control-row">
        <div class="control-label">
          <span>Интервал между морганиями (сек)</span>
          <span class="control-value" id="blinkIntervalVal">3</span>
        </div>
        <input type="range" id="blinkInterval" min="1" max="10" value="3">
      </div>
      <button class="btn" id="blinkNowBtn" style="width:100%;">Моргнуть сейчас</button>
    </div>
  </div>

  <!-- Metrics Card -->
  <div class="card metrics-card">
    <div class="card-title">Отладочная информация</div>
    <div class="card-subtitle">Метрики ESP32 в реальном времени</div>
    <div class="metrics-grid">
      <div class="metric"><div class="metric-label">Свободно памяти</div><div class="metric-value" id="mHeap">— КБ</div></div>
      <div class="metric"><div class="metric-label">Время работы</div><div class="metric-value" id="mUptime">—</div></div>
      <div class="metric"><div class="metric-label">Wi-Fi сигнал</div><div class="metric-value" id="mClients">—</div></div>
      <div class="metric"><div class="metric-label">Размер флеш-памяти</div><div class="metric-value" id="mFlash">— МБ</div></div>
    </div>
    <div style="margin-top: 16px; display: flex; gap: 8px; flex-wrap: wrap;">
      <button class="btn" id="refreshBtn">Обновить</button>
      <button class="btn danger" id="rebootBtn">Перезагрузка</button>
    </div>
  </div>

</div>

<div class="footer-info">
  Сеть: <strong>SMITeleop</strong> (STA-режим) · <strong>AP fallback: Kuzmich / 12345678</strong> &middot;
  <a href="http://esp32-control.local" style="color:var(--accent-3)">esp32-control.local</a>
</div>

<div class="team-photo-wrap">
  <img class="team-photo" src="/team.jpg" alt="Команда Агроинженеры">
</div>

<div class="signature">
  <div class="love">Сделано с любовью на агрохакатоне 2026</div>
  <div class="team">Команда «Агроинженеры»: Николай, Леонид, Ярослав, Ярослав Дикий и Матвей</div>
</div>

<div class="toast" id="toast"></div>

<script>
const ANIMATIONS = ['off','static','rainbow','rainbow_cycle','chase','breathing','theater','wipe','scanner','dual'];

let ws = null;
let wsReconnectDelay = 500;
let lastSendTimes = {};
let pendingSends = {};
let rafScheduled = false;
let syncMode = false;

function connect() {
  const proto = location.protocol === 'https:' ? 'wss:' : 'ws:';
  const wsUrl = proto + '//' + location.hostname + ':81';
  ws = new WebSocket(wsUrl);

  ws.onopen = () => {
    wsReconnectDelay = 500;
    setStatus(true);
    showToast('Подключено', 'success');
    sendCmd({cmd: 'get_state'});
  };
  ws.onclose = () => { setStatus(false); ws = null; scheduleReconnect(); };
  ws.onerror = () => { if (ws) ws.close(); };
  ws.onmessage = (e) => {
    try { handleMessage(JSON.parse(e.data)); }
    catch (err) { console.warn('parse error', err); }
  };
}

function scheduleReconnect() {
  showToast('Реконнект через ' + (wsReconnectDelay/1000) + 'с…', 'error');
  setTimeout(() => {
    wsReconnectDelay = Math.min(wsReconnectDelay * 1.5, 8000);
    connect();
  }, wsReconnectDelay);
}

function sendCmd(obj) {
  if (ws && ws.readyState === WebSocket.OPEN) ws.send(JSON.stringify(obj));
}

function flushPending() {
  rafScheduled = false;
  const now = Date.now();
  for (const k in pendingSends) {
    const last = lastSendTimes[k] || 0;
    if (now - last >= 40) {
      sendCmd(pendingSends[k]);
      lastSendTimes[k] = now;
      delete pendingSends[k];
    }
  }
  if (Object.keys(pendingSends).length > 0) {
    rafScheduled = true;
    requestAnimationFrame(flushPending);
  }
}

function sendThrottled(key, obj) {
  pendingSends[key] = obj;
  if (!rafScheduled) {
    rafScheduled = true;
    requestAnimationFrame(flushPending);
  }
}

function handleMessage(msg) {
  if (msg.type === 'state') applyState(msg);
  else if (msg.type === 'heartbeat') updateMetrics(msg);
  else if (msg.type === 'error') showToast(msg.message || 'Ошибка', 'error');
}

function applyState(s) {
  if (s.features) {
    const card = document.getElementById('servoCard');
    if (!s.features.servos) card.classList.add('hidden');
    else {
      card.classList.remove('hidden');
      document.getElementById('servoBadge').innerHTML = '<span class="badge">включено</span>';
    }
  }
  if (s.animation) {
    document.querySelectorAll('.anim-btn').forEach(b =>
      b.classList.toggle('active', b.dataset.anim === s.animation));
  }
  if (s.color)  { document.getElementById('colorPicker').value  = s.color; syncSlidersFromHex(s.color); }
  if (s.color2) document.getElementById('color2Picker').value = s.color2;
  if (typeof s.servo_speed === 'number') {
    document.getElementById('servoSpeed').value = s.servo_speed;
    document.getElementById('servoSpeedVal').textContent = s.servo_speed;
  }
  if (typeof s.brightness === 'number') {
    document.getElementById('brightness').value = s.brightness;
    document.getElementById('brightnessVal').textContent = s.brightness;
  }
  if (typeof s.speed === 'number') {
    document.getElementById('speed').value = s.speed;
    document.getElementById('speedVal').textContent = s.speed;
  }
  if (typeof s.servo1_angle === 'number') {
    document.getElementById('servo1').value = s.servo1_angle;
    document.getElementById('servo1Val').textContent = s.servo1_angle;
  }
  if (typeof s.servo2_angle === 'number') {
    // Уже инвертирован от сервера
    document.getElementById('servo2').value = s.servo2_angle;
    document.getElementById('servo2Val').textContent = s.servo2_angle;
  }
  if (typeof s.servo1_enabled === 'boolean')
    document.getElementById('servo1Toggle').classList.toggle('on', s.servo1_enabled);
  if (typeof s.servo2_enabled === 'boolean')
    document.getElementById('servo2Toggle').classList.toggle('on', s.servo2_enabled);
  // Автоматическое моргание
  if (typeof s.auto_blink_enabled === 'boolean') {
    document.getElementById('autoBlinkToggle').classList.toggle('on', s.auto_blink_enabled);
  }
  if (typeof s.auto_blink_interval === 'number') {
    const sec = s.auto_blink_interval;
    document.getElementById('blinkInterval').value = sec;
    document.getElementById('blinkIntervalVal').textContent = sec;
  }
  if (typeof s.flash_size === 'number')
    document.getElementById('mFlash').textContent = (s.flash_size / 1048576).toFixed(0) + ' МБ';
  updateMetrics(s);
}

function updateMetrics(s) {
  if (typeof s.heap_free === 'number')
    document.getElementById('mHeap').textContent = (s.heap_free / 1024).toFixed(1) + ' КБ';
  if (typeof s.uptime_sec === 'number')
    document.getElementById('mUptime').textContent = formatUptime(s.uptime_sec);
  if (typeof s.wifi_rssi === 'number')
    document.getElementById('mClients').textContent = s.wifi_rssi + ' dBm';
}

function formatUptime(sec) {
  const d = Math.floor(sec / 86400);
  const h = Math.floor((sec % 86400) / 3600);
  const m = Math.floor((sec % 3600) / 60);
  const s = sec % 60;
  if (d > 0) return d + 'd ' + h + 'h';
  if (h > 0) return h + 'h ' + m + 'm';
  if (m > 0) return m + 'm ' + s + 's';
  return s + 's';
}

function setStatus(connected) {
  document.getElementById('statusDot').classList.toggle('connected', connected);
  document.getElementById('statusText').textContent = connected ? 'Подключено' : 'Отключено';
}

