OneToThreeCreator/Unitree_g1_edu_control_panel/head_unitree_custom/src/esp32_control_light.cpp
let toastTimer = null;
function showToast(text, kind) {
  const t = document.getElementById('toast');
  t.textContent = text;
  t.className = 'toast show' + (kind ? ' ' + kind : '');
  if (toastTimer) clearTimeout(toastTimer);
  toastTimer = setTimeout(() => t.className = 'toast', 2500);
}

document.querySelectorAll('.anim-btn').forEach(btn => {
  btn.addEventListener('click', () => {
    sendCmd({cmd: 'led_animation', name: btn.dataset.anim});
    document.querySelectorAll('.anim-btn').forEach(b => b.classList.remove('active'));
    btn.classList.add('active');
  });
});

// ── Цвет + RGB палитра ──────────────────────────────────────────────
function clamp255(v) { return Math.max(0, Math.min(255, v | 0)); }
function toHex(r, g, b) {
  return '#' + [r, g, b].map(x => clamp255(x).toString(16).padStart(2, '0')).join('');
}
function syncSlidersFromHex(hex) {
  const n = parseInt(hex.slice(1), 16);
  const r = (n >> 16) & 255, g = (n >> 8) & 255, b = n & 255;
  document.getElementById('rSlider').value = r; document.getElementById('rVal').textContent = r;
  document.getElementById('gSlider').value = g; document.getElementById('gVal').textContent = g;
  document.getElementById('bSlider').value = b; document.getElementById('bVal').textContent = b;
  document.getElementById('paletteSwatch').style.background = hex;
}
function pushColorFromSliders() {
  const r = parseInt(document.getElementById('rSlider').value);
  const g = parseInt(document.getElementById('gSlider').value);
  const b = parseInt(document.getElementById('bSlider').value);
  document.getElementById('rVal').textContent = r;
  document.getElementById('gVal').textContent = g;
  document.getElementById('bVal').textContent = b;
  const hex = toHex(r, g, b);
  document.getElementById('colorPicker').value = hex;
  document.getElementById('paletteSwatch').style.background = hex;
  sendThrottled('color', {cmd: 'led_color', color: hex});
}

document.getElementById('colorPicker').addEventListener('input', (e) => {
  syncSlidersFromHex(e.target.value);
  sendThrottled('color', {cmd: 'led_color', color: e.target.value});
});
document.getElementById('color2Picker').addEventListener('input', (e) =>
  sendThrottled('color2', {cmd: 'led_color2', color: e.target.value}));
['rSlider', 'gSlider', 'bSlider'].forEach(id =>
  document.getElementById(id).addEventListener('input', pushColorFromSliders));

document.getElementById('servoSpeed').addEventListener('input', (e) => {
  document.getElementById('servoSpeedVal').textContent = e.target.value;
  sendThrottled('servospeed', {cmd: 'servo_speed', value: parseInt(e.target.value)});
});

document.getElementById('brightness').addEventListener('input', (e) => {
  document.getElementById('brightnessVal').textContent = e.target.value;
  sendThrottled('brightness', {cmd: 'led_brightness', value: parseInt(e.target.value)});
});
document.getElementById('speed').addEventListener('input', (e) => {
  document.getElementById('speedVal').textContent = e.target.value;
  sendThrottled('speed', {cmd: 'led_speed', value: parseInt(e.target.value)});
});

document.getElementById('servo1').addEventListener('input', (e) => {
  const v = parseInt(e.target.value);
  document.getElementById('servo1Val').textContent = v;
  if (syncMode) {
    document.getElementById('servo2').value = v;
    document.getElementById('servo2Val').textContent = v;
    sendThrottled('servo_both', {cmd: 'servo_both', angle: v});
  } else sendThrottled('servo1', {cmd: 'servo', which: 1, angle: v});
});
document.getElementById('servo2').addEventListener('input', (e) => {
  const v = parseInt(e.target.value);
  document.getElementById('servo2Val').textContent = v;
  if (syncMode) {
    document.getElementById('servo1').value = v;
    document.getElementById('servo1Val').textContent = v;
    sendThrottled('servo_both', {cmd: 'servo_both', angle: v});
  } else sendThrottled('servo2', {cmd: 'servo', which: 2, angle: v});
});

document.getElementById('servo1Toggle').addEventListener('click', (e) => {
  const on = !e.currentTarget.classList.contains('on');
  e.currentTarget.classList.toggle('on', on);
  sendCmd({cmd: 'servo_enable', which: 1, enabled: on});
});
document.getElementById('servo2Toggle').addEventListener('click', (e) => {
  const on = !e.currentTarget.classList.contains('on');
  e.currentTarget.classList.toggle('on', on);
  sendCmd({cmd: 'servo_enable', which: 2, enabled: on});
});

document.getElementById('syncToggle').addEventListener('click', (e) => {
  syncMode = !syncMode;
  e.currentTarget.classList.toggle('on', syncMode);
  showToast(syncMode ? 'Sync ON — оба серво вместе' : 'Sync OFF');
});

document.querySelectorAll('.preset-btn').forEach(btn => {
  btn.addEventListener('click', () => {
    const which = parseInt(btn.dataset.servo);
    const angle = parseInt(btn.dataset.angle);
    if (syncMode) {
      sendCmd({cmd: 'servo_both', angle: angle});
      document.getElementById('servo1').value = angle;
      document.getElementById('servo2').value = angle;
      document.getElementById('servo1Val').textContent = angle;
      document.getElementById('servo2Val').textContent = angle;
    } else {
      sendCmd({cmd: 'servo_preset', which: which, angle: angle});
      document.getElementById('servo' + which).value = angle;
      document.getElementById('servo' + which + 'Val').textContent = angle;
    }
  });
});

document.querySelectorAll('.macro-btn').forEach(btn => {
  btn.addEventListener('click', () => {
    const name = btn.dataset.macro;
    if (name === 'stop') { sendCmd({cmd: 'servo_macro_stop'}); showToast('Макрос остановлен'); }
    else { sendCmd({cmd: 'servo_macro', name: name}); showToast('Макрос: ' + name); }
  });
});

// ── Автоматическое моргание ──────────────────────────────────────────
document.getElementById('autoBlinkToggle').addEventListener('click', (e) => {
  const on = !e.currentTarget.classList.contains('on');
  e.currentTarget.classList.toggle('on', on);
  sendCmd({cmd: 'auto_blink', enabled: on});
  showToast(on ? 'Автоморгание включено' : 'Автоморгание выключено');
});

document.getElementById('blinkInterval').addEventListener('input', (e) => {
  const sec = parseInt(e.target.value);
  document.getElementById('blinkIntervalVal').textContent = sec;
  sendThrottled('blinkinterval', {cmd: 'auto_blink', interval: sec});
});

document.getElementById('blinkNowBtn').addEventListener('click', () => {
  sendCmd({cmd: 'blink_now'});
  showToast('Моргание');
});

document.getElementById('refreshBtn').addEventListener('click', () => {
  sendCmd({cmd: 'get_state'}); showToast('Запрошено состояние');
});
document.getElementById('rebootBtn').addEventListener('click', () => {
  if (confirm('Перезагрузить ESP32?')) { sendCmd({cmd: 'reboot'}); showToast('Перезагрузка…'); }
});

fetch('/state').then(r => r.json()).then(s => applyState(s)).catch(() => {});
connect();
</script>
</body>
</html>
)HTML";